package java_classes;

public class CreateStudent {
    StudentInfo popkov = new StudentInfo(123, "Попков", "Андрей", "Васильевич",
            "1992-08-18", "Советская д.2 кв.17", 345423, "Физический",
            3, "ФЗ-3");
    StudentInfo vladov = new StudentInfo(17, "Владов", "Семен", "Петрович",
            "1993-02-10", "Владимирова д.3 кв.14", 343455, "Физический",
            2, "ФЗ-2");
    StudentInfo sevastyanov = new StudentInfo(27, "Севастьянов", "Алексей", "Николаевич",
            "1991-01-15", "Фрунзе д.45 кв.1223", 346534, "Физический",
            4, "ФЗ-4");
    StudentInfo kotina = new StudentInfo(177, "Котина", "Екатерина", "Ивановна",
            "1991-06-15", "Филипова д.5 кв.166", 547689, "Физический",
            4, "ФЗ-4");
    StudentInfo ivanov = new StudentInfo(67, "Иванов", "Флександр", "Петрович",
            "1994-12-19", "РечицкоеШоссе д.5 кв.18", 326344, "Физический",
            1, "ФЗ-1");
    StudentInfo filatova = new StudentInfo(456, "Филатова", "Наталья", "Александровна",
            "1994-05-16", "Комсомольская д.6 кв.125", 658934, "Биологический",
            1, "БИ-1");
    StudentInfo antonova = new StudentInfo(56, "Антонова", "Полина", "Андреевна",
            "1993-02-17", "Партизанская д.67 кв.156", 456534, "Биологический",
            2, "БИ-2");
    StudentInfo smirnova = new StudentInfo(433, "Смирнова", "Татьяна", "Николавна",
            "1992-06-30", "Ланге д.58 кв.199", 234544, "Биологический",
            3, "БИ-3");
    StudentInfo kurash = new StudentInfo(432, "Кураш", "Алена", "Валентиновна",
            "1992-05-25", "Жемчужная д.47 кв.4", 567678, "Биологический",
            3, "БИ-3");
    StudentInfo kemej = new StudentInfo(12, "Кемеж", "Павел", "Николаевич",
            "1991-03-25", "ленина д.52 кв.139", 456567, "Биологический",
            4, "БИ-4");


    StudentInfo[] students = {popkov, vladov, sevastyanov, kotina, ivanov, filatova, antonova, smirnova, kurash, kemej};




}
